Homework/HW4/HW4-S16.tex
% Created 2016-02-15 Mon 23:15
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\geometry{margin=1.0in}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage[labelfont=bf]{caption}
\usepackage{setspace}
\setlength{\headheight}{10.2pt}
\setlength{\headsep}{20pt}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2016 W.\ F.\ Schneider}
\rfoot{\thepage}
\chead{\bf{Introduction to Chemical Engineering (CBE 20255)\vspace{12pt}}}
\lhead{\bf{Homework 4}}
\rhead{\bf{Due February 22, 2016}}
\usepackage{titlesec}
\titlespacing*{\section}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\title{University of Notre Dame\\Introduction to Chemical Engineering\\(CBE 20255)}
\author{Prof. William F.\ Schneider}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\usepackage{siunitx}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CBE 60553 Outline}
\begin{document}

\begin{options}
\end{options}

\noindent \textbf{Solve each problem on a separate sheets of Engineering Computation paper.  Carefully and neatly document your answers. Box your final answer, reporting it with the correct number of significant figures and units.  Use plotting software for all plots.}


\section{NO!}
\label{sec-1}
One of the steps in the production of nitric acid is the oxidation of ammonia (\ce{NH3}) with \ce{O2} to form nitric oxide and water.

\begin{enumerate}
\item (2 pts) Write a balanced equation for \ce{NH3} oxidation.
\item (2 pts) How many lb-mole of \ce{O2} does it take to completely react 10 lb-mole \ce{NH3}?
\item (2 pts) \ce{NH3} flows into an oxidation reactor at a rate of 100 kmol/hr.  What rate must oxygen be fed to maintain a 40\% excess of \ce{O2}?
\item (4 pts) 50.0 kg/hr of \ce{NH3} and 100.0 kg/hr \ce{O2} are fed to a continuous reactor.  Plot the mass flow rates of all the reactants and products as a function of the conversion of the limiting reagent.
\end{enumerate}

\section{\href{https://www.youtube.com/watch?v=yykSHeVXD8I}{Deacon Blues (Or an Ode to Wake Forest)}}
\label{sec-2}
In the Deacon process, \ce{Cl2} is made by oxidizing \ce{HCl} with \ce{O2}.  Sufficient dry air is fed to provide 35\% excess oxygen, and the conversion of \ce{HCl} is 85\%.
\begin{enumerate}
\item (2 pts) Write a balanced equation for the Deacon process.
\item (4 pts) Draw and label a flow chart for this process.
\item (4 pts) Use atomic species balances to determine the product stream composition, in mole fractions.
\item (4 pts) Use advancements to determine the product stream composition, in mole fractions.
\item (2 pts) The Deacon process could be run with pure \ce{O2} rather than air.  Speculate on one cost advantage and one cost disadvantage of doing so.
\end{enumerate}

\section{Commonly known as alcohol}
\label{sec-3}
Industrial ethanol can be produced by the hydration of ethylene:
\begin{equation}
\label{eq:1}
\ce{C2H4 + H2O -> C2H5OH}
\end{equation}
Some of the product is converted to diethyl ether in a side reaction:
\begin{equation}
\label{eq:2}
\ce{2 C2H5OH -> (C2H5)2O + H2O}
\end{equation}
The reactor feed contains ethylene, steam, and an inert diluent.  The reactor effluent is found to contain 43.3\%(mol/mol) ethylene, 2.5\% ethanol, 0.14\% ether,  9.3\% diluent, and balance \ce{H2O}.

\begin{enumerate}
\item (3 pts) Draw molecular representations of ethylene, ethanol, and diethyl ether. Pay attention to single, double, \ldots{}, bonds, as well as appropriate representations of bond angles and torsions.
\item (4 pts) Draw and label a process flow chart for this process, assuming a 100 mol/hr effluent basis.
\item (2 pts) Determine the number of degrees of freedom in the problem as stated.
\item (4 pts) Compute the composition and flow rate of the reactor feed.
\item (2 pts) Compute the ethylene conversion.
\item (2 pts) Compute the ethanol yield.
\item (2 pts) Compute the selectivity to ethanol over the ether.
\item (2 pts) What would you expect to happen to (a) the ethanol yield and (b) the selectivity if the reactor was run to higher conversion?
\end{enumerate}

\section{Reduce, reuse, recycle}
\label{sec-4}
Methanol is synthesized from carbon monoxide and hydrogen in a catalytic reactor.  The fresh feed contains 32.0\%(mol/mol) CO, 64.0\%(mol/mol) \ce{H2}, and 4.0\%(mol/mol) \ce{N2}.  The fresh stream is mixed with a recycle stream in a 1:5 fresh:recycle mole ratio.  As a result, the inlet to the reactor is 13.0\% \ce{N2}.  The reactor effluent goes to a condenser that separates a pure liquid stream of only methanol from a gas stream of CO, \ce{H2}, and \ce{N2}.  Part of the gas stream is removed as a purge, while the remainder is recycled.

\begin{enumerate}
\item (2 pts) Write a balanced equation for methanol synthesis from CO and \ce{H2}.
\item (6 pts) Draw and fully label a process flow chart for this process.
\item (6 pts) Assuming a methanol production rate of 100 kmol/hr, calculate the required fresh feed rate, the composition of the purge stream, and the purge flow rate.
\item (2 pts) Compute the overall CO conversion.
\item (4 pts) Compute the single-pass reactor conversion.
\item (2 pts) What is the point of including (a) a recycle and (b) a purge in this process?
\end{enumerate}
% Emacs 25.0.50.1 (Org mode 8.2.10)
\end{document}